sweat_log_api/app/controllers/api/v1/details_controller.rb

  def create
    @workout = Workout.find_by_id(params[:workout_id])
    @detail = @workout.details.create(detail_params)
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
INSERT INTO "details" ("workout_id", "sets_poses", "distance", "time", "created_at", "updated_at", "weight") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["workout_id", 18], ["sets_poses", 2], ["distance", ""], ["time", "3"], ["created_at", "2020-12-09 00:01:33.296767"], ["updated_at", "2020-12-09 00:01:33.296767"], ["weight", 0]]