sweat_log_api/app/controllers/api/v1/workouts_controller.rb

INSERT INTO "workouts" ("name", "created_at", "updated_at", "rating") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "HIIT"], ["created_at", "2020-12-01 23:38:26.182018"], ["updated_at", "2020-12-01 23:38:26.182018"], ["rating", 7]]
---
  def create
    @workout = Workout.create(workout_params)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "workouts" WHERE "workouts"."id" = $1  [["id", 29]]
---
  def destroy
    @workout = Workout.find_by_id(params[:id])
    @workout.destroy